; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x  - location ?y - location) 
		(path ?x  - location ?y - location)
		(empty ?v - truck)
)
  (:functions 	
		(time-to-drive ?l1 - location ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-3-3-7)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	s9 - location
	s10 - location
	s11 - location
	s12 - location
	p1-12 - location
	p2-3 - location
	p2-4 - location
	p2-6 - location
	p3-6 - location
	p3-7 - location
	p3-9 - location
	p4-8 - location
	p5-11 - location
	p6-0 - location
	p6-5 - location
	p6-10 - location
	p7-8 - location
	p7-10 - location
	p8-10 - location
	p8-11 - location
	p9-1 - location
	p9-6 - location
	p9-8 - location
	p9-11 - location
	p11-1 - location
	p11-2 - location
	p12-3 - location
	)
	(:init
	(at driver1 s8)
	(at driver2 s3)
	(at driver3 s5)
	(at truck1 s6)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s0)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s5)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at package1 s10)
	(at package2 s10)
	(at package3 s11)
	(at package4 s6)
	(at package5 s10)
	(at package6 s6)
	(at package7 s0)
	(path s1 p1-12)
	(path p1-12 s1)
	(path s12 p1-12)
	(path p1-12 s12)
	(path s2 p2-3)
	(path p2-3 s2)
	(path s3 p2-3)
	(path p2-3 s3)
	(path s2 p2-4)
	(path p2-4 s2)
	(path s4 p2-4)
	(path p2-4 s4)
	(path s2 p2-6)
	(path p2-6 s2)
	(path s6 p2-6)
	(path p2-6 s6)
	(path s3 p3-6)
	(path p3-6 s3)
	(path s6 p3-6)
	(path p3-6 s6)
	(path s3 p3-7)
	(path p3-7 s3)
	(path s7 p3-7)
	(path p3-7 s7)
	(path s3 p3-9)
	(path p3-9 s3)
	(path s9 p3-9)
	(path p3-9 s9)
	(path s4 p4-8)
	(path p4-8 s4)
	(path s8 p4-8)
	(path p4-8 s8)
	(path s5 p5-11)
	(path p5-11 s5)
	(path s11 p5-11)
	(path p5-11 s11)
	(path s6 p6-0)
	(path p6-0 s6)
	(path s0 p6-0)
	(path p6-0 s0)
	(path s6 p6-5)
	(path p6-5 s6)
	(path s5 p6-5)
	(path p6-5 s5)
	(path s6 p6-10)
	(path p6-10 s6)
	(path s10 p6-10)
	(path p6-10 s10)
	(path s7 p7-8)
	(path p7-8 s7)
	(path s8 p7-8)
	(path p7-8 s8)
	(path s7 p7-10)
	(path p7-10 s7)
	(path s10 p7-10)
	(path p7-10 s10)
	(path s8 p8-10)
	(path p8-10 s8)
	(path s10 p8-10)
	(path p8-10 s10)
	(path s8 p8-11)
	(path p8-11 s8)
	(path s11 p8-11)
	(path p8-11 s11)
	(path s9 p9-1)
	(path p9-1 s9)
	(path s1 p9-1)
	(path p9-1 s1)
	(path s9 p9-6)
	(path p9-6 s9)
	(path s6 p9-6)
	(path p9-6 s6)
	(path s9 p9-8)
	(path p9-8 s9)
	(path s8 p9-8)
	(path p9-8 s8)
	(path s9 p9-11)
	(path p9-11 s9)
	(path s11 p9-11)
	(path p9-11 s11)
	(path s11 p11-1)
	(path p11-1 s11)
	(path s1 p11-1)
	(path p11-1 s1)
	(path s11 p11-2)
	(path p11-2 s11)
	(path s2 p11-2)
	(path p11-2 s2)
	(path s12 p12-3)
	(path p12-3 s12)
	(path s3 p12-3)
	(path p12-3 s3)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 4)
	(= (time-to-drive s1 s0) 4)
	(link s0 s3)
	(link s3 s0)
	(= (time-to-drive s0 s3) 50)
	(= (time-to-drive s3 s0) 50)
	(link s0 s6)
	(link s6 s0)
	(= (time-to-drive s0 s6) 4)
	(= (time-to-drive s6 s0) 4)
	(link s0 s7)
	(link s7 s0)
	(= (time-to-drive s0 s7) 64)
	(= (time-to-drive s7 s0) 64)
	(link s2 s0)
	(link s0 s2)
	(= (time-to-drive s2 s0) 91)
	(= (time-to-drive s0 s2) 91)
	(link s2 s4)
	(link s4 s2)
	(= (time-to-drive s2 s4) 87)
	(= (time-to-drive s4 s2) 87)
	(link s2 s12)
	(link s12 s2)
	(= (time-to-drive s2 s12) 14)
	(= (time-to-drive s12 s2) 14)
	(link s3 s1)
	(link s1 s3)
	(= (time-to-drive s3 s1) 12)
	(= (time-to-drive s1 s3) 12)
	(link s3 s2)
	(link s2 s3)
	(= (time-to-drive s3 s2) 47)
	(= (time-to-drive s2 s3) 47)
	(link s3 s7)
	(link s7 s3)
	(= (time-to-drive s3 s7) 29)
	(= (time-to-drive s7 s3) 29)
	(link s3 s8)
	(link s8 s3)
	(= (time-to-drive s3 s8) 80)
	(= (time-to-drive s8 s3) 80)
	(link s4 s5)
	(link s5 s4)
	(= (time-to-drive s4 s5) 12)
	(= (time-to-drive s5 s4) 12)
	(link s4 s7)
	(link s7 s4)
	(= (time-to-drive s4 s7) 46)
	(= (time-to-drive s7 s4) 46)
	(link s5 s0)
	(link s0 s5)
	(= (time-to-drive s5 s0) 49)
	(= (time-to-drive s0 s5) 49)
	(link s5 s6)
	(link s6 s5)
	(= (time-to-drive s5 s6) 23)
	(= (time-to-drive s6 s5) 23)
	(link s5 s8)
	(link s8 s5)
	(= (time-to-drive s5 s8) 78)
	(= (time-to-drive s8 s5) 78)
	(link s6 s1)
	(link s1 s6)
	(= (time-to-drive s6 s1) 84)
	(= (time-to-drive s1 s6) 84)
	(link s6 s2)
	(link s2 s6)
	(= (time-to-drive s6 s2) 27)
	(= (time-to-drive s2 s6) 27)
	(link s6 s4)
	(link s4 s6)
	(= (time-to-drive s6 s4) 50)
	(= (time-to-drive s4 s6) 50)
	(link s7 s8)
	(link s8 s7)
	(= (time-to-drive s7 s8) 8)
	(= (time-to-drive s8 s7) 8)
	(link s7 s10)
	(link s10 s7)
	(= (time-to-drive s7 s10) 26)
	(= (time-to-drive s10 s7) 26)
	(link s8 s0)
	(link s0 s8)
	(= (time-to-drive s8 s0) 2)
	(= (time-to-drive s0 s8) 2)
	(link s9 s0)
	(link s0 s9)
	(= (time-to-drive s9 s0) 50)
	(= (time-to-drive s0 s9) 50)
	(link s9 s1)
	(link s1 s9)
	(= (time-to-drive s9 s1) 63)
	(= (time-to-drive s1 s9) 63)
	(link s9 s6)
	(link s6 s9)
	(= (time-to-drive s9 s6) 32)
	(= (time-to-drive s6 s9) 32)
	(link s9 s10)
	(link s10 s9)
	(= (time-to-drive s9 s10) 84)
	(= (time-to-drive s10 s9) 84)
	(link s9 s11)
	(link s11 s9)
	(= (time-to-drive s9 s11) 20)
	(= (time-to-drive s11 s9) 20)
	(link s10 s0)
	(link s0 s10)
	(= (time-to-drive s10 s0) 12)
	(= (time-to-drive s0 s10) 12)
	(link s10 s3)
	(link s3 s10)
	(= (time-to-drive s10 s3) 29)
	(= (time-to-drive s3 s10) 29)
	(link s10 s8)
	(link s8 s10)
	(= (time-to-drive s10 s8) 77)
	(= (time-to-drive s8 s10) 77)
	(link s11 s2)
	(link s2 s11)
	(= (time-to-drive s11 s2) 41)
	(= (time-to-drive s2 s11) 41)
	(link s11 s3)
	(link s3 s11)
	(= (time-to-drive s11 s3) 32)
	(= (time-to-drive s3 s11) 32)
	(link s11 s4)
	(link s4 s11)
	(= (time-to-drive s11 s4) 27)
	(= (time-to-drive s4 s11) 27)
	(link s11 s8)
	(link s8 s11)
	(= (time-to-drive s11 s8) 45)
	(= (time-to-drive s8 s11) 45)
	(link s12 s3)
	(link s3 s12)
	(= (time-to-drive s12 s3) 96)
	(= (time-to-drive s3 s12) 96)
	(link s12 s4)
	(link s4 s12)
	(= (time-to-drive s12 s4) 18)
	(= (time-to-drive s4 s12) 18)
	(link s12 s9)
	(link s9 s12)
	(= (time-to-drive s12 s9) 31)
	(= (time-to-drive s9 s12) 31)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver1 s9)
	(at driver2 s4)
	(at driver3 s1)
	(at truck2 s5)
	(at truck3 s12)
	(at package1 s9)
	(at package2 s12)
	(at package4 s1)
	(at package5 s9)
	(at package7 s5)
	))

(:metric minimize (+ (* 1 (total-time)) (* 2 (fuel-used))))

)

; plan
1. (walk driver1 s8 p9-8)
   deleted: (at driver1 s8)
   added: (at driver1 p9-8)
   goals met: 0 of 10
2. (walk driver1 p9-8 s9)
   deleted: (at driver1 p9-8)
   added: (at driver1 s9)
   goals met: 1 of 10
3. (board-truck driver3 truck3 s5)
   deleted: (at driver3 s5) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 1 of 10
4. (drive-truck truck3 s5 s0 driver3)
   deleted: (at truck3 s5)
   added: (at truck3 s0)
   changed: (fuel-used) from 0 to 490
   goals met: 1 of 10
5. (load-truck package7 truck3 s0)
   deleted: (at package7 s0)
   added: (in package7 truck3)
   changed: (load truck3) from 0 to 1, (fuel-per-minute truck3) from 10 to 11
   goals met: 1 of 10
6. (drive-truck truck3 s0 s9 driver3)
   deleted: (at truck3 s0)
   added: (at truck3 s9)
   changed: (fuel-used) from 490 to 1040
   goals met: 1 of 10
7. (walk driver2 s3 p2-3)
   deleted: (at driver2 s3)
   added: (at driver2 p2-3)
   goals met: 1 of 10
8. (walk driver2 p2-3 s2)
   deleted: (at driver2 p2-3)
   added: (at driver2 s2)
   goals met: 1 of 10
9. (walk driver2 s2 p2-4)
   deleted: (at driver2 s2)
   added: (at driver2 p2-4)
   goals met: 1 of 10
10. (walk driver2 p2-4 s4)
   deleted: (at driver2 p2-4)
   added: (at driver2 s4)
   goals met: 2 of 10
11. (drive-truck truck3 s9 s10 driver3)
   deleted: (at truck3 s9)
   added: (at truck3 s10)
   changed: (fuel-used) from 1040 to 1964
   goals met: 2 of 10
12. (load-truck package5 truck3 s10)
   deleted: (at package5 s10)
   added: (in package5 truck3)
   changed: (load truck3) from 1 to 2, (fuel-per-minute truck3) from 11 to 13
   goals met: 2 of 10
13. (drive-truck truck3 s10 s9 driver3)
   deleted: (at truck3 s10)
   added: (at truck3 s9)
   changed: (fuel-used) from 1964 to 3056
   goals met: 2 of 10
14. (unload-truck package5 truck3 s9)
   deleted: (in package5 truck3)
   added: (at package5 s9)
   changed: (load truck3) from 2 to 1, (fuel-per-minute truck3) from 13 to 11
   goals met: 3 of 10
15. (drive-truck truck3 s9 s10 driver3)
   deleted: (at truck3 s9)
   added: (at truck3 s10)
   changed: (fuel-used) from 3056 to 3980
   goals met: 3 of 10
16. (load-truck package1 truck3 s10)
   deleted: (at package1 s10)
   added: (in package1 truck3)
   changed: (load truck3) from 1 to 2, (fuel-per-minute truck3) from 11 to 13
   goals met: 3 of 10
17. (drive-truck truck3 s10 s9 driver3)
   deleted: (at truck3 s10)
   added: (at truck3 s9)
   changed: (fuel-used) from 3980 to 5072
   goals met: 3 of 10
18. (unload-truck package1 truck3 s9)
   deleted: (in package1 truck3)
   added: (at package1 s9)
   changed: (load truck3) from 2 to 1, (fuel-per-minute truck3) from 13 to 11
   goals met: 4 of 10
19. (drive-truck truck3 s9 s10 driver3)
   deleted: (at truck3 s9)
   added: (at truck3 s10)
   changed: (fuel-used) from 5072 to 5996
   goals met: 4 of 10
20. (load-truck package2 truck3 s10)
   deleted: (at package2 s10)
   added: (in package2 truck3)
   changed: (load truck3) from 1 to 2, (fuel-per-minute truck3) from 11 to 13
   goals met: 4 of 10
21. (drive-truck truck3 s10 s9 driver3)
   deleted: (at truck3 s10)
   added: (at truck3 s9)
   changed: (fuel-used) from 5996 to 7088
   goals met: 4 of 10
22. (drive-truck truck3 s9 s6 driver3)
   deleted: (at truck3 s9)
   added: (at truck3 s6)
   changed: (fuel-used) from 7088 to 7504
   goals met: 4 of 10
23. (load-truck package4 truck3 s6)
   deleted: (at package4 s6)
   added: (in package4 truck3)
   changed: (load truck3) from 2 to 3, (fuel-per-minute truck3) from 13 to 16
   goals met: 4 of 10
24. (drive-truck truck3 s6 s5 driver3)
   deleted: (at truck3 s6)
   added: (at truck3 s5)
   changed: (fuel-used) from 7504 to 7872
   goals met: 4 of 10
25. (unload-truck package7 truck3 s5)
   deleted: (in package7 truck3)
   added: (at package7 s5)
   changed: (load truck3) from 3 to 2, (fuel-per-minute truck3) from 16 to 13
   goals met: 5 of 10
26. (drive-truck truck3 s5 s4 driver3)
   deleted: (at truck3 s5)
   added: (at truck3 s4)
   changed: (fuel-used) from 7872 to 8028
   goals met: 5 of 10
27. (drive-truck truck3 s4 s12 driver3)
   deleted: (at truck3 s4)
   added: (at truck3 s12)
   changed: (fuel-used) from 8028 to 8262
   goals met: 6 of 10
28. (unload-truck package2 truck3 s12)
   deleted: (in package2 truck3)
   added: (at package2 s12)
   changed: (load truck3) from 2 to 1, (fuel-per-minute truck3) from 13 to 11
   goals met: 7 of 10
29. (disembark-truck driver3 truck3 s12)
   deleted: (driving driver3 truck3)
   added: (at driver3 s12) (empty truck3)
   goals met: 7 of 10
30. (walk driver3 s12 p1-12)
   deleted: (at driver3 s12)
   added: (at driver3 p1-12)
   goals met: 7 of 10
31. (walk driver1 s9 p9-6)
   deleted: (at driver1 s9)
   added: (at driver1 p9-6)
   goals met: 6 of 10
32. (walk driver3 p1-12 s12)
   deleted: (at driver3 p1-12)
   added: (at driver3 s12)
   goals met: 6 of 10
33. (board-truck driver3 truck3 s12)
   deleted: (at driver3 s12) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 6 of 10
34. (drive-truck truck3 s12 s3 driver3)
   deleted: (at truck3 s12)
   added: (at truck3 s3)
   changed: (fuel-used) from 8262 to 9318
   goals met: 5 of 10
35. (drive-truck truck3 s3 s1 driver3)
   deleted: (at truck3 s3)
   added: (at truck3 s1)
   changed: (fuel-used) from 9318 to 9450
   goals met: 5 of 10
36. (unload-truck package4 truck3 s1)
   deleted: (in package4 truck3)
   added: (at package4 s1)
   changed: (load truck3) from 1 to 0, (fuel-per-minute truck3) from 11 to 10
   goals met: 6 of 10
37. (disembark-truck driver3 truck3 s1)
   deleted: (driving driver3 truck3)
   added: (at driver3 s1) (empty truck3)
   goals met: 7 of 10
38. (walk driver1 p9-6 s6)
   deleted: (at driver1 p9-6)
   added: (at driver1 s6)
   goals met: 7 of 10
39. (walk driver1 s6 p6-0)
   deleted: (at driver1 s6)
   added: (at driver1 p6-0)
   goals met: 7 of 10
40. (walk driver1 p6-0 s0)
   deleted: (at driver1 p6-0)
   added: (at driver1 s0)
   goals met: 7 of 10
41. (board-truck driver3 truck3 s1)
   deleted: (at driver3 s1) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 6 of 10
42. (drive-truck truck3 s1 s9 driver3)
   deleted: (at truck3 s1)
   added: (at truck3 s9)
   changed: (fuel-used) from 9450 to 10080
   goals met: 6 of 10
43. (drive-truck truck3 s9 s12 driver3)
   deleted: (at truck3 s9)
   added: (at truck3 s12)
   changed: (fuel-used) from 10080 to 10390
   goals met: 7 of 10
44. (drive-truck truck3 s12 s3 driver3)
   deleted: (at truck3 s12)
   added: (at truck3 s3)
   changed: (fuel-used) from 10390 to 11350
   goals met: 6 of 10
45. (drive-truck truck3 s3 s0 driver3)
   deleted: (at truck3 s3)
   added: (at truck3 s0)
   changed: (fuel-used) from 11350 to 11850
   goals met: 6 of 10
46. (board-truck driver1 truck2 s0)
   deleted: (at driver1 s0) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 6 of 10
47. (drive-truck truck2 s0 s9 driver1)
   deleted: (at truck2 s0)
   added: (at truck2 s9)
   changed: (fuel-used) from 11850 to 12350
   goals met: 6 of 10
48. (drive-truck truck2 s9 s6 driver1)
   deleted: (at truck2 s9)
   added: (at truck2 s6)
   changed: (fuel-used) from 12350 to 12670
   goals met: 6 of 10
49. (drive-truck truck3 s0 s2 driver3)
   deleted: (at truck3 s0)
   added: (at truck3 s2)
   changed: (fuel-used) from 12670 to 13580
   goals met: 6 of 10
50. (drive-truck truck2 s6 s5 driver1)
   deleted: (at truck2 s6)
   added: (at truck2 s5)
   changed: (fuel-used) from 13580 to 13810
   goals met: 7 of 10
51. (drive-truck truck3 s2 s6 driver3)
   deleted: (at truck3 s2)
   added: (at truck3 s6)
   changed: (fuel-used) from 13810 to 14080
   goals met: 7 of 10
52. (disembark-truck driver1 truck2 s5)
   deleted: (driving driver1 truck2)
   added: (at driver1 s5) (empty truck2)
   goals met: 7 of 10
53. (drive-truck truck3 s6 s9 driver3)
   deleted: (at truck3 s6)
   added: (at truck3 s9)
   changed: (fuel-used) from 14080 to 14400
   goals met: 7 of 10
54. (walk driver1 s5 p6-5)
   deleted: (at driver1 s5)
   added: (at driver1 p6-5)
   goals met: 7 of 10
55. (walk driver1 p6-5 s6)
   deleted: (at driver1 p6-5)
   added: (at driver1 s6)
   goals met: 7 of 10
56. (walk driver1 s6 p9-6)
   deleted: (at driver1 s6)
   added: (at driver1 p9-6)
   goals met: 7 of 10
57. (walk driver1 p9-6 s9)
   deleted: (at driver1 p9-6)
   added: (at driver1 s9)
   goals met: 8 of 10
58. (drive-truck truck3 s9 s12 driver3)
   deleted: (at truck3 s9)
   added: (at truck3 s12)
   changed: (fuel-used) from 14400 to 14710
   goals met: 9 of 10
59. (disembark-truck driver3 truck3 s12)
   deleted: (driving driver3 truck3)
   added: (at driver3 s12) (empty truck3)
   goals met: 9 of 10
60. (walk driver3 s12 p1-12)
   deleted: (at driver3 s12)
   added: (at driver3 p1-12)
   goals met: 9 of 10
61. (walk driver3 p1-12 s1)
   deleted: (at driver3 p1-12)
   added: (at driver3 s1)
   goals met: 10 of 10
